Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТехнологическиеОперации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МаршрутныеКарты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитВложенныйМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенныйМаршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор операции в маршрутной карте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВариантыЗагрузкиРабочихЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВариантыЗагрузкиРабочихЦентров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Синхронный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Асинхронный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТехнологическиеОперации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НЕ СодержитВложенныйМаршрут Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ВложенныйМаршрут");
		
		ЗначенияРеквизитовРЦ = ЗначенияРеквизитовРЦ();
		Если НЕ ЗначенияРеквизитовРЦ.ИспользуютсяВариантыНаладки Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВариантНаладки");
		КонецЕсли;
		Если НЕ ЗначенияРеквизитовРЦ.ПараллельнаяЗагрузка Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Загрузка");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РабочийЦентр) И РабочийЦентрСинхроннаяЗагрузка() Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВремяШтучное");
		КонецЕсли;
		
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("ВариантНаладки");
		МассивНепроверяемыхРеквизитов.Добавить("Загрузка");
		МассивНепроверяемыхРеквизитов.Добавить("ВремяШтучное");
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если НомерОперации >= НомерСледующейОперации 
		И НомерСледующейОперации <> 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Номер следующей операции должен быть больше номера операции.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "НомерСледующейОперации",, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемаяОперацияНеДолжнаИспользоватьсяВМаршрутнойКарте(Отказ);
	
	ПроверитьЗацикливание(Отказ);
	
	ЗаполнитьСлужебныеРеквизиты();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = 0;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") Тогда
		НомерОперации = Справочники.ТехнологическиеОперации.НовыйНомерОперации(ДанныеЗаполнения.Владелец);
		НомерСледующейОперации = НомерОперации + 1;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ЗаполнитьСлужебныеРеквизиты() Экспорт
	
	// При копировании маршрутной карты исполняется альтернативный обработчик создания технологической операции
	//  см. Справочники.ТехнологическиеОперации.СкопироватьТехнологическуюОперацию()
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = Справочники.ТехнологическиеОперации.НовыйИдентификаторОперации(Владелец);
	КонецЕсли;

КонецПроцедуры

Процедура УдаляемаяОперацияНеДолжнаИспользоватьсяВМаршрутнойКарте(Отказ)

	Если НЕ ЭтоНовый() И ПометкаУдаления И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаСвязи.Ссылка
		|ИЗ
		|	Справочник.МаршрутныеКарты.ВыходныеИзделия КАК ТаблицаСвязи
		|ГДЕ
		|	ТаблицаСвязи.ОперацияРедактирование = &Операция
		|	И НЕ ТаблицаСвязи.Ссылка.ПометкаУдаления
		|	И ТаблицаСвязи.Ссылка = &Владелец";
		
		Запрос.УстановитьПараметр("Операция", Ссылка);
		Запрос.УстановитьПараметр("Владелец", Владелец);
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Операция используется в маршрутной карте. Удаление невозможно.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
 
Процедура ПроверитьЗацикливание(Отказ)

	Если НЕ СодержитВложенныйМаршрут Тогда
		Возврат;
	КонецЕсли;
	
	Если Справочники.ТехнологическиеОперации.ЕстьЗацикливание(ВложенныйМаршрут, Владелец, Отказ) Тогда
		ТекстСообщения = НСтр("ru = 'Выбранный вложенный маршрут приводит к зацикливанию операций.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, "ВложенныйМаршрут",, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

Функция ЗначенияРеквизитовРЦ()
	
	Если ЗначениеЗаполнено(РабочийЦентр) Тогда
		
		ИменаРеквизитов = Новый Структура;
		ИменаРеквизитов.Вставить("ИспользуютсяВариантыНаладки", "ИспользуютсяВариантыНаладки");
		ИменаРеквизитов.Вставить("ПараллельнаяЗагрузка", "ПараллельнаяЗагрузка");
		
		Если ТипЗнч(РабочийЦентр) = Тип("СправочникСсылка.РабочиеЦентры") Тогда
			Для каждого Элемент Из ИменаРеквизитов Цикл
				ИменаРеквизитов[Элемент.Ключ] = "ВидРабочегоЦентра." + Элемент.Значение;
			КонецЦикла;
		КонецЕсли;
		
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочийЦентр, ИменаРеквизитов);
		
	Иначе
		
		Результат = Новый Структура;
		Результат.Вставить("ИспользуютсяВариантыНаладки", Ложь);
		Результат.Вставить("ПараллельнаяЗагрузка", Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РабочийЦентрСинхроннаяЗагрузка()
	
	Если ТипЗнч(РабочийЦентр) = Тип("СправочникСсылка.ВидыРабочихЦентров") Тогда
		ИмяРеквизита = "ВариантЗагрузки";
	Иначе
		ИмяРеквизита = "ВидРабочегоЦентра.ВариантЗагрузки";
	КонецЕсли;
	
	ВариантЗагрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, ИмяРеквизита);
	Возврат ВариантЗагрузки = Перечисления.ВариантыЗагрузкиРабочихЦентров.Синхронный;
	
КонецФункции

#КонецОбласти
 
#КонецОбласти

#КонецЕсли
